Revit 2026 API

# ElectricalSettingAddWireMaterialType Method

---

**Note: This API is now obsolete.**

Add a new type of wire material.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("AddWireMaterialType is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use ConductorMaterial.Create() instead.")]
public WireMaterialType AddWireMaterialType(
	string name,
	WireMaterialType baseMaterial
)
```
```vb
<ObsoleteAttribute("AddWireMaterialType is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use ConductorMaterial.Create() instead.")>
Public Function AddWireMaterialType (
	name As String,
	baseMaterial As WireMaterialType
) As WireMaterialType
```
```cpp
public:
[ObsoleteAttribute(L"AddWireMaterialType is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use ConductorMaterial.Create() instead.")]
WireMaterialType^ AddWireMaterialType(
	String^ name,
	WireMaterialType^ baseMaterial
)
```
```fsharp
[<ObsoleteAttribute("AddWireMaterialType is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use ConductorMaterial.Create() instead.")>]
member AddWireMaterialType :
        name : string *
        baseMaterial : WireMaterialType -> WireMaterialType
```

#### Parameters

name String
    Name of new material type.
baseMaterial WireMaterialType
    Specify an existing material type which New material will be constructed based on.

#### Return Value

WireMaterialTypeNew added wire material type object.

#### Reference

ElectricalSetting Class

Autodesk.Revit.DB.Electrical Namespace